app/Controllers/ProductController.php

    public function index()
    {
        $model = new ProductModel();
        $data['products'] = $model->findAll();
---
SELECT *
FROM `products`